package nowcoder.code.list;

/**
 * @author chenyuqun@zlongame.com
 * @date 2023/8/28
 *
 * 13 判断一个链表是否为回文结构
 * 描述：
 *    给定一个链表，请判断该链表是否为回文结构。
 *    回文是指该字符串正序逆序完全一致。
 * {@link Bm13Solution#main(String[])} ()}
 *
 * 14 链表的奇偶重排
 * 描述：
 *    给定一个单链表，请设定一个函数，将链表的奇数位节点和偶数位节点分别放在一起，重排后输出。
 *    注意是节点的编号而非节点的数值。
 * 示例：
 *    输入：
 *    `{1,2,3,4,5,6}`
 *    返回值：
 *    `{1,3,5,2,4,6}`
 *    说明：
 *    `1->2->3->4->5->6->NULL重排后为1->3->5->2->4->6->NULL`
 * {@link Bm14Solution#main(java.lang.String[])}
 *
 * 15 删除有序链表中重复的元素-I
 * 描述：
 *    删除给出链表中的重复元素（链表中元素从小到大有序），使链表中的所有元素都只出现一次
 *    例如：给出的链表为1→1→2,返回1→21→2.给出的链表为1→1→2→3→3,返回1→2→3.
 * 示例：
 *   输入：
 *   `{1,1,2}`
 *   返回值：
 *   `{1,2}`
 * {@link Bm15Solution#main(String[])}
 *
 * 16 删除有序链表中重复的元素-II
 * 描述：
 *    给出一个升序排序的链表，删除链表中的所有重复出现的元素，只保留原链表中只出现一次的元素。
 *    例如：给出的链表为1→2→3→3→4→4→5返回1→2→5, 给出的链表为1→1→1→2→3返回2→3
 *
 */

class package_info {
}
